[
  {
    "productCode": "96820-5102",
    "productName": "Turbo Levo SL Comp",
    "colors": "red,turquoise ",
    "productPhotos": "side.jpg,detail.jpg,back.jpg",
    "productLine": "E-Mountain Bikes",
    "productVendor": "Specialized",
    "productDescription": "Das Levo SL ist eine neue, leichte Generation von E-Mountainbikes, das die schnelle und vielseitige Plattform unseres Stumpjumper nutzt… und gerade genug Power bietet, um eine völlig neue Ride-Erfahrung zu erleben. Dank einer cleveren Komponentenauswahl bringt das Levo SL Comp all das mit - zu einem ebenso radikalen Preis.",
    "productContent": "Das Levo SL ist eine neue, leichte Generation von E-Mountainbikes, das die schnelle und vielseitige Plattform unseres Stumpjumper nutzt… und gerade genug Power bietet, um eine völlig neue Ride-Erfahrung zu erleben. Dank einer cleveren Komponentenauswahl bringt das Levo SL Comp all das mit - zu einem ebenso radikalen Preis.",
    "quantityInStock": 1000,
    "buyPrice": 5109.0,
    "MSRP": 5999.0,
    "createdAt": "",
    "updatedAt": ""
  },
  {
    "productCode": "91321-7001",
    "productName": "Epic Hardtail",
    "colors": "red,black",
    "productPhotos": "side.jpg,detail.jpg,back.jpg",
    "productLine": "Cross Country Mountain Bikes",
    "productVendor": "Specialized",
    "productDescription": "Du hast den Blick gesehen. Den 'Die-fahren-das-nicht-wirklich-auf-einem-Hardtail' -Blick. Nun, bereite dich darauf vor, mit dem Epic Hardtail noch viel mehr davon zu bekommen. Schnell und leicht trifft auf vertrauenserweckend und leistungsfähig - all das in einem Bike, das entwickelt wurde, um den Cross Country-Speed neu zu definieren.",
    "productContent": "Du hast den Blick gesehen. Den 'Die-fahren-das-nicht-wirklich-auf-einem-Hardtail' -Blick. Nun, bereite dich darauf vor, mit dem Epic Hardtail noch viel mehr davon zu bekommen. Schnell und leicht trifft auf vertrauenserweckend und leistungsfähig - all das in einem Bike, das entwickelt wurde, um den Cross Country-Speed neu zu definieren. Das Streben nach dem leichtest möglichen Bike war lange Zeit ein Rennen innerhalb des Rennens, aber zu welchem Preis? Der Kampf um jedes Gramm wurde nicht ohne Opfer ausgefochten - XC-Hardtail Racebikes stehen für einen hartes, nervöses Fahrgefühl, auf Kosten der Leistungsfähigkeit und Vielseitigkeit. Aber wer hat gesagt, dass einen der Kampf gegen solch ein Ross schneller macht? Stattdessen erkannten wir, dass das schnellste Fahrrad mehr ist als nur das leichteste. Und genau hier kommt unser Trail-fressendes, erstaunlich komfortables, federleichtes und super schnelle Epic Hardtail ins Spiel. Natürlich haben wir jeden Zentimeter des Epic Hardtail-Rahmens optimiert, um den ohnehin leichtesten Serien-Hardtail-Rahmen der Welt zu bauen. Aber eine Priorität lag auch darauf, ein Epic Hardtail zu entwickeln, das ebenso leistungsfähig wie auch komfortabel ist - mit einer aggressiven Singletrack-Geometrie, erhöhter Reifenfreiheit und einem Rahmen, der hier auch auf eine erhöhte vertikale Nachgiebigkeit ausgelegt ist. Eine RockShox Judy Gold Gabel sowie ein Shimano Antrieb sind die Highlights des Aufbaus und sorgen für ein ausgewogenes Preis-Leistungs-Verhältnis und damit für ein beeindruckendes Ergebnis.",
    "quantityInStock": 500,
    "buyPrice": 2099.0,
    "MSRP": 2099.0,
    "createdAt": "",
    "updatedAt": ""
  },
  {
    "productCode": "95221-7202",
    "productName": "Turbo Levo",
    "colors": "black,yellow",
    "productPhotos": "side.jpg,detail.jpg,back.jpg",
    "productLine": "E-Mountain Bikes",
    "productVendor": "Specialized",
    "productDescription": "Das neue Turbo Levo bietet so vielen Fahrern wie möglich die fortschrittlichste E-MTB-Rahmen-, Motor- und Batterietechnologie. Wir haben unseren fortschrittlichen M5-Aluminiumrahmen und den geschmeidigsten und leistungsstärksten Motor auf dem Markt mit den Antriebs-, Aufhängungs- und Bremskomponenten kombiniert, die ein herausragendes Preis-Leistungs-Verhältnis bieten.",
    "productContent": "Das neue Turbo Levo bietet so vielen Fahrern wie möglich die fortschrittlichste E-MTB-Rahmen-, Motor- und Batterietechnologie. Wir haben unseren fortschrittlichen M5-Aluminiumrahmen und den geschmeidigsten und leistungsstärksten Motor auf dem Markt mit den Antriebs-, Aufhängungs- und Bremskomponenten kombiniert, die ein herausragendes Preis-Leistungs-Verhältnis bieten. Das Ergebnis ist ein Bike, das viele E-MTBs in den Schatten stellt, die viel mehr kosten.",
    "quantityInStock": 1500,
    "buyPrice": 4999.0,
    "MSRP": 4999.0,
    "createdAt": "",
    "updatedAt": ""
  },
  {
    "productCode": "97420-0101",
    "productName": "S-Works Shiv Disc – SRAM RED eTap AXS",
    "colors": "red",
    "productPhotos": "side.jpg,detail.jpg,back.jpg",
    "productLine": "Triathlon Bikes",
    "productVendor": "Specialized",
    "productDescription": "Das neue Shiv ist schneller denn je: Es ist aerodynamisch, fokussiert und bietet jede Menge Stauraum - und doch ist es komplett neu konzipiert.",
    "productContent": "Das neue Shiv ist schneller denn je: Es ist aerodynamisch, fokussiert und bietet jede Menge Stauraum - und doch ist es komplett neu konzipiert. Scheibenbremsen: check. Reisetauglich: check. Und die integrierten Verstaumöglichkeiten sind so konstruiert, dass sie das Rad noch aerodynamischer machen. Wir sehen uns auf dem Podium!\nMit seinen Roval CLX 64 Carbon Disc Laufrädern, dem SRAM RED eTap AXS 1-fach Antrieb, hydraulischen Bremsen sowie der S-Works Cranks Power Kurbel bist du allzeit bereit für's Podium.",
    "quantityInStock": 200,
    "buyPrice": 11999.0,
    "MSRP": 11999.0,
    "createdAt": "",
    "updatedAt": ""
  },
  {
    "productCode": "91921-7022",
    "productName": "P.3",
    "colors": "black",
    "productPhotos": "side.jpg,detail.jpg,back.jpg",
    "productLine": "BMX & Dirt Jump Bikes",
    "productVendor": "Specialized",
    "productDescription": "Unser Hardtail Freestyler P.3 liefert eine bombensicheres Fahrgefühl mit vielseitiger Geometrie ab - egal, ob du im Park bist, einen Flow Trail surfst oder Street-Sessions abhältst.",
    "productContent": "Unser Hardtail Freestyler P.3 liefert eine bombensicheres Fahrgefühl mit vielseitiger Geometrie ab - egal, ob du im Park bist, einen Flow Trail surfst oder Street-Sessions abhältst.",
    "quantityInStock": 300,
    "buyPrice": 1799.0,
    "MSRP": 1799.0,
    "createdAt": "",
    "updatedAt": ""
  }
]
